# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

fruits = ['яблоко', 'банан', 'киви', 'арбуз']
number = 0

for fruit in fruits:
    number +=1
    print('{}. {:>6}'.format(number, fruit))
