# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

arr1 = ['a', 'b', 'c', 'd', 'c', 'f', 'j', 'h']
arr2 = ['a', 'c']

for ar2 in arr2:
    for ar1 in arr1:
        if ar1==ar2:
            arr1.pop(arr1.index(ar1))


print (arr1)